In [1]:
import pandas as pd

# For f500 dataset - Read and Print

In [ ]:
We'll be working with data set from Fortune magazine's Global 500 list 2017, which ranks the top 500 corporations worldwide 
by revenue. The dataset is a CSV file called f500.csv.
Now you need to do two things on this dataset:
1. Read the dataset using pandas
Note: To import the dataset, the file name is "f500.csv"
2. Print the shape of the dataset

In [3]:
df = pd.read_csv('f500.csv')
print(df.shape)

(500, 17)

# For f500 dataset - Datatypes

In [ ]:
We have been given a dataset of Fortune magazine's Global 500 list 2017, which ranks the top 500 corporations 
worldwide by revenue. The dataset is a CSV file called "f500.csv".
Our task is to read the csv file using pandas and print the data type of each column.

In [6]:
df = pd.read_csv('f500.csv')
print(df.dtypes)

company                      object
rank                          int64
revenues                      int64
revenue_change              float64
profits                     float64
assets                        int64
profit_change               float64
ceo                          object
industry                     object
sector                       object
previous_rank                 int64
country                      object
hq_location                  object
website                      object
years_on_global_500_list      int64
employees                     int64
total_stockholder_equity      int64
dtype: object

# For f500 dataset - Describe

In [9]:
df = pd.read_csv('f500.csv')
print(df['profits'].describe())

count      499.000000
mean      3055.203206
std       5171.981071
min     -13038.000000
25%        556.950000
50%       1761.600000
75%       3954.000000
max      45687.000000
Name: profits, dtype: float64

# Read CSV

In [ ]:
Write a program to import the given CSV file using Pandas and display the first 10 rows of the dataset. 
The dataset is a CSV file called "CollegePlacements.csv".

In [ ]:
import pandas as pd

df = pd.read_csv('CollegePlacements.csv')
print(df.head(10))

# Count of Flower

In [ ]:
Find and print count of each kind of flower (separated by space)?
Note: Get the dataset from here
Print the count as Integer Value.

In [1]:
import pandas as pd

df = pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')
s1 = df[df['variety']=='Setosa'].describe()
s2 = df[df['variety']=='Versicolor'].describe()
s3 = df[df['variety']=='Virginica'].describe()

print(s1)
print(f'{int(s1.iloc[0,0])} {int(s2.iloc[0,0])} {int(s3.iloc[0,0])}')

       sepal.length  sepal.width  petal.length  petal.width
count      50.00000    50.000000     50.000000    50.000000
mean        5.00600     3.428000      1.462000     0.246000
std         0.35249     0.379064      0.173664     0.105386
min         4.30000     2.300000      1.000000     0.100000
25%         4.80000     3.200000      1.400000     0.200000
50%         5.00000     3.400000      1.500000     0.200000
75%         5.20000     3.675000      1.575000     0.300000
max         5.80000     4.400000      1.900000     0.600000
50 50 50

# Iris Virginica

In [37]:
df = pd.read_csv('https://files.codingninjas.in/iris-8116.csv?_ga=2.248838159.981330417.1691074454-1882396549.1658417346&_gac=1.90643560.1688030592.Cj0KCQjw1_SkBhDwARIsANbGpFvgEMLcKt61lEAgyt5KDen2gqvPlLdwpBlUdi6_vl20Z61Au7DtyE0aAhRxEALw_wcB')

s1 = df[(df['variety']=='Iris-virginica') & (df['petal.length'] > 1.5)]

for i in s1.values:
    print(f'{i[0]} {i[1]} {i[2]} {i[3]} {i[4]}')

6.3 3.3 6.0 2.5 Iris-virginica
5.8 2.7 5.1 1.9 Iris-virginica
7.1 3.0 5.9 2.1 Iris-virginica
6.3 2.9 5.6 1.8 Iris-virginica
6.5 3.0 5.8 2.2 Iris-virginica
7.6 3.0 6.6 2.1 Iris-virginica
4.9 2.5 4.5 1.7 Iris-virginica
7.3 2.9 6.3 1.8 Iris-virginica
6.7 2.5 5.8 1.8 Iris-virginica
7.2 3.6 6.1 2.5 Iris-virginica
6.5 3.2 5.1 2.0 Iris-virginica
6.4 2.7 5.3 1.9 Iris-virginica
6.8 3.0 5.5 2.1 Iris-virginica
5.7 2.5 5.0 2.0 Iris-virginica
5.8 2.8 5.1 2.4 Iris-virginica
6.4 3.2 5.3 2.3 Iris-virginica
6.5 3.0 5.5 1.8 Iris-virginica
7.7 3.8 6.7 2.2 Iris-virginica
7.7 2.6 6.9 2.3 Iris-virginica
6.0 2.2 5.0 1.5 Iris-virginica
6.9 3.2 5.7 2.3 Iris-virginica
5.6 2.8 4.9 2.0 Iris-virginica
7.7 2.8 6.7 2.0 Iris-virginica
6.3 2.7 4.9 1.8 Iris-virginica
6.7 3.3 5.7 2.1 Iris-virginica
7.2 3.2 6.0 1.8 Iris-virginica
6.2 2.8 4.8 1.8 Iris-virginica
6.1 3.0 4.9 1.8 Iris-virginica
6.4 2.8 5.6 2.1 Iris-virginica
7.2 3.0 5.8 1.6 Iris-virginica
7.4 2.8 6.1 1.9 Iris-virginica
7.9 3.8 6.4 2.0 Iris-virginica
6.4 2.8 5.6 2.2 Iris-virginica
6.3 2.8 5.1 1.5 Iris-virginica
6.1 2.6 5.6 1.4 Iris-virginica
7.7 3.0 6.1 2.3 Iris-virginica
6.3 3.4 5.6 2.4 Iris-virginica
6.4 3.1 5.5 1.8 Iris-virginica
6.0 3.0 4.8 1.8 Iris-virginica
6.9 3.1 5.4 2.1 Iris-virginica
6.7 3.1 5.6 2.4 Iris-virginica
6.9 3.1 5.1 2.3 Iris-virginica
5.8 2.7 5.1 1.9 Iris-virginica
6.8 3.2 5.9 2.3 Iris-virginica
6.7 3.3 5.7 2.5 Iris-virginica
6.7 3.0 5.2 2.3 Iris-virginica
6.3 2.5 5.0 1.9 Iris-virginica
6.5 3.0 5.2 2.0 Iris-virginica
6.2 3.4 5.4 2.3 Iris-virginica
5.9 3.0 5.1 1.8 Iris-virginica

# For f500 dataset - Top 5

In [ ]:
Using the "f500.csv" dataset, Print the top 5 countries having the most companies in this list.
Output Format
USA        <number of companies>
China      <number of companies>

#### value_counts() function returns object containing counts of unique values . The resulting object will be in descending order so that the first element is the most frequently-occurring element

In [49]:
df = pd.read_csv('f500.csv')
print(df['country'].value_counts().iloc[:5])

USA        132
China      109
Japan       51
Germany     29
France      29
Name: country, dtype: int64

# For f500 dataset - Selected Rows and Columns

In [50]:
df = pd.read_csv('f500.csv')
print(df.iloc[:5,:3])

                    company  rank  revenues
0                   Walmart     1    485873
1                State Grid     2    315199
2             Sinopec Group     3    267518
3  China National Petroleum     4    262573
4              Toyota Motor     5    254694

In [51]:
df = pd.read_csv('f500.csv')
test = df.copy()
test.head()

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
3,China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
4,Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

In [53]:
test.drop('company',axis=1,inplace=True)
test.head()

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
3,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
4,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

# Update Row

In [ ]:
Alex Grayson recently got placed and was offered a salary of 240000. (Alex's row index is 194).
Write a program to update this row.

Update:
  Status="Placed"<br>
  Salary="240000"
            
Columns: Index(['S.no', 'Name', 'Gender', 'MBA_percentage', 'Highschool_percentage','Status', 'Salary'],dtype='object')

In [66]:
import pandas as pd
df=pd.read_csv("CollegePlacements.csv")

df.iloc[194,5] = 'Placed'
df.iloc[194,6] = '240000'
print(df.iloc[194,:])

S.no                              195
Name                     Alex Grayson
Gender                              M
MBA_percentage                   55.0
Highschool_percentage           64.74
Status                         Placed
Salary                         240000
Name: 194, dtype: object

# DataFrame Basic Indexing

In [ ]:
Write a program to Print total number of students with atleast 60 Highschool_percentage. Also print their mean MBA_percentage. 
The dataset is a CSV file called "CollegePlacements.csv".

S.no MBA_percentage Highschool_percentage Salary
count 134.000000 134.000000 134.000000 134.000000
mean 108.865672 68.243731 65.813582 213634.328358
std 60.624419 10.415461 4.227577 165085.876082
min 2.000000 42.160000 60.020000 0.000000
25% 54.250000 61.340000 62.465000 0.000000
50% 113.000000 67.000000 65.290000 245000.000000
75% 160.750000 74.915000 68.545000 300000.000000
max 215.000000 97.700000 77.890000 940000.000000

Output:
    134 68

In [65]:
import pandas as pd
df=pd.read_csv("CollegePlacements.csv")

s = df[df['Highschool_percentage']>60].describe()
print(f'{int(s.iloc[0,0])} {float(s.iloc[1,1])}')

134 68.2437313432836

# Data Frame Indexing

In [ ]:
Write a program to calculate total number of unplaced males with  atleast 50 MBA_percentage. 
The dataset is a CSV file called "CollegePlacements.csv".

In [64]:
import pandas as pd

df = pd.read_csv('CollegePlacements.csv')

s = df[(df['Status'] == 'Not Placed') & (df['MBA_percentage'] >= 50) & (df['Gender'] == 'M')].describe()
print(int(s.iloc[0,0]))

29

# Delete Column

In [ ]:
There is a column called S.no in the dataset. 
Write a program to drop "S.no" column from the dataset. 
The dataset is a CSV file called "CollegePlacements.csv".

Before:
      S.no Name Gender
    1 2 Justin Ritter M
    2 3 Craig Reiter M
    3 4 Katherine Murray M
    
After:
      Name Gender MBA_percentage
    1 Justin Ritter M 78.33
    2 Craig Reiter M 68.00
    3 Katherine Murray M 52.00

In [63]:
import pandas as pd

df=pd.read_csv("CollegePlacements.csv")

df.drop('S.no',axis=1,inplace=True)
print(df.iloc[1:10,0:3])

               Name Gender  MBA_percentage
1     Justin Ritter      M           78.33
2      Craig Reiter      M           68.00
3  Katherine Murray      M           52.00
4       Rick Hansen      M           73.60
5       Jim Mitchum      M           49.80
6     Toby Swindell      F           49.20
7        Mick Brown      M           64.00
8         Jane Waco      M           79.00
9       Joseph Holt      M           70.00

# Iris Values

In [ ]:
Find and print the minimum, maximum and average value of the feature for each kind of flower ?
Print the value with two decimal places.
Note: Order for flower is Iris-setosa, Iris-versicolor and Iris-virginica.

In [34]:
data_file=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',header=None)
data_file.columns = ['sl', 'sw', 'pl', 'pw', 'flower_type']

for n in ['Iris-setosa','Iris-versicolor','Iris-virginica']:
    file=data_file[data_file['flower_type']==n]
    data=file.describe()
    
    for i in ['min','max','mean']:
        for j in ['sl','sw','pl','pw']:
            print('%.2f'%data[j][i],end=" ")
        print(n)

4.30 2.30 1.00 0.10 Iris-setosa
5.80 4.40 1.90 0.60 Iris-setosa
5.01 3.42 1.46 0.24 Iris-setosa
4.90 2.00 3.00 1.00 Iris-versicolor
7.00 3.40 5.10 1.80 Iris-versicolor
5.94 2.77 4.26 1.33 Iris-versicolor
4.90 2.20 4.50 1.40 Iris-virginica
7.90 3.80 6.90 2.50 Iris-virginica
6.59 2.97 5.55 2.03 Iris-virginica

# Data Frame Indexing

In [ ]:
Write a program to print the difference between number of unplaced and number of placed students who scored atleast 
65 MBA_percentage 
The dataset is a CSV file called "CollegePlacements.csv".

In [82]:
import pandas as pd

df = pd.read_csv('CollegePlacements.csv')

s1 = df[(df['MBA_percentage'] >= 65) & (df['Status'] == 'Placed')]
s2 = df[(df['MBA_percentage'] >= 65) & (df['Status'] == 'Not Placed')]

print(df)

     S.no              Name Gender  MBA_percentage  Highschool_percentage  \
0       1       Rick Hansen      M           91.00                  58.80
1       2     Justin Ritter      M           78.33                  66.28
2       3      Craig Reiter      M           68.00                  57.80
3       4  Katherine Murray      M           52.00                  59.43
4       5       Rick Hansen      M           73.60                  55.50
..    ...               ...    ...             ...                    ...
210   211         Ken Black      M           82.00                  74.49
211   212  Logan Haushalter      M           60.00                  53.62
212   213     Eleni McCrary      M           67.00                  69.72
213   214         Mary Zewe      F           66.00                  60.23
214   215         Kent Will      M           58.00                  60.22

         Status  Salary
0        Placed  270000
1        Placed  200000
2        Placed  250000
3    Not Placed       0
4        Placed  425000
..          ...     ...
210      Placed  400000
211      Placed  275000
212      Placed  295000
213      Placed  204000
214  Not Placed       0

[215 rows x 7 columns]

# DataFrame Indexing -2

In [ ]:
Write a program to print total number of unplaced females whose name starts with "E". 
The dataset is a CSV file called "CollegePlacements.csv".

Output:
    2

In [62]:
import pandas as pd

df = pd.read_csv('CollegePlacements.csv')

s = df[(df['Status'] == 'Not Placed') & (df['Gender'] == 'F') & (df['Name'].str.startswith('E'))].describe()

print(int(s.iloc[0,0]))

2

# Create New Column

In [ ]:
Write a program to create a new column called "Average_percentage" which contains average percentage of student from 
both MBA and High School percentage.<br>
Print the first 10 rows of this column. 
The dataset is a CSV file called "CollegePlacements.csv".

Run Output:
    0 74.900
    1 72.305
    2 62.900
    3 55.715
    4 64.550
    5 50.690

In [61]:
import pandas as pd

df = pd.read_csv('CollegePlacements.csv')
df['Average_percentage'] = (df['MBA_percentage']+df['Highschool_percentage'])/2

print(df['Average_percentage'].head(10))

0    74.900
1    72.305
2    62.900
3    55.715
4    64.550
5    50.690
6    51.245
7    63.070
8    70.145
9    61.105
Name: Average_percentage, dtype: float64

# Select the rows with NaN values

In [ ]:
In the given dataset, print the total number of rows where the value of age is null.

In [60]:
import numpy as np
import pandas as pd

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
print(df['age'].isnull().sum())

2

# Imputing

In [ ]:
Columns MBA_percentage and Highschool_percentage contain missing values.
Write a program to fill in the missing values for both the columns, using mean.
The dataset is a CSV file called "CollegePlacements.csv".

Output:
    0 0 (as no NaN values are there)

In [67]:
import pandas as pd
df=pd.read_csv("CollegePlacements.csv")

df['MBA_percentage'].fillna(df['MBA_percentage'].mean(),inplace=True)
df['Highschool_percentage'].fillna(df['Highschool_percentage'].mean(),inplace=True)

print(df.MBA_percentage.isnull().sum(),df.Highschool_percentage.isnull().sum())

0 0